[
  {
    "quote": "For each headache you face, ask yourself, “Is this mostly real or mostly imagined?"
  },
  {
    "quote": "Relax. Your rumination, analysis, worry, and need to control the future are robbing you of the current moment. Yes, there is a time for preparation, but continually thinking of the future guarantees you’ll never enjoy the present."
  },
  {
    "quote": "Exerting more effort doesn’t help if you’re on the wrong trajectory.\n\n– Working harder on the wrong thing just wastes more time.\n\n– Learning more from a biased source will lead you further from the truth.\n\n– Doubling down on a toxic relationship only sets you up for more headaches.\n\nBefore you try harder, make sure you are walking a path that leads where you want to go."
  },
  {
    "quote": "It’s never the right time, but right now is usually the best time."
  },
  {
    "quote": "A simple rule that makes life easier:\n\nAlways strive to give value before you ask for value."
  },
  {
    "quote": "Three ways to learn something new:\n\nReflect on what you have already tried.\nAttempt something you have not tried.\nRead about what someone else has tried."
  },
  {
    "quote": "The imperfect project you actually complete is worth more than the perfect project you never finish."
  },
  {
    "quote": "You won’t always get what you strive for, but you will definitely get what you settle for. You won’t magically outperform your standards."
  },
  {
    "quote": "Be ruthless about what you ignore. Time, energy, and resources are so precious. You have to be ferocious about cutting your priorities—more than you realize and certainly more than is comfortable.\n\nYou can only deeply commit to a few things. One or two? Maybe three?\n\nEvery pretty good, sorta nice, kinda fun thing you abandon is like shedding a weighted vest that lets you move at top speed. You were so busy focusing on how much you could carry, you never realized you could run this fast."
  },
  {
    "quote": "Consistency enlarges ability."
  },
  {
    "quote": "You probably don’t want maximum effectiveness.\n\nFor example, the most effective way to make money likely requires a lifestyle you don’t want to live. Instead, you want the most effective path that fits your desired lifestyle.\n\nHow do you want to spend your days? Start there, then optimize."
  },
  {
    "quote": "One of the most unexpected gifts you can receive is an early loss.\n\nMissing out on a job you really wanted.\nTrying a business idea that fails.\nSuffering a heartbreak.\n\nAn early setback can become the catalyst for a wonderful next chapter—if you channel the emotion effectively.\n\nDisappointment is a hot burning fuel. Let it light your fire to become better."
  },
  {
    "quote": "You are not the cause of everything that happens to you, but you are responsible for how you respond to everything that happens to you."
  },
  {
    "quote": "It is not too late to do what you want to do—if you stop waiting for the time to be right."
  },
  {
    "quote": "Life is harder when you expect a lot of the world and little of yourself.\n\nLife is easier when you expect a lot of yourself and little of the world.\n\nHigh standards, low expectations."
  },
  {
    "quote": "The pessimist criticizes, the optimist creates."
  },
  {
    "quote": "Save more money than you think you need. Life is unexpected and your future tastes will likely be more expensive. Not worrying about money tomorrow is worth more than whatever you could buy today."
  },
  {
    "quote": "I have learned that whenever I think “I don’t have enough time to do that"
  },
  {
    "quote": "The days can be easy if the years are consistent. You can write a book or get in shape or code a piece of software in 30 minutes per day. But the key is you can’t miss a bunch of days."
  },
  {
    "quote": "The wedding is an event, love is a practice.\n\nThe graduation is an event, education is a practice.\n\nThe race is an event, fitness is a practice.\n\nThe heart, mind, and body are endless pursuits."
  },
  {
    "quote": "The obvious way to buy back your time is to pay someone to do something for you. Pay the mechanic to change your oil or a dry cleaner to press your suit.\n\nThe less obvious way to buy back your time is to say no. Passing on a promotion might “buy"
  },
  {
    "quote": "If you want a recipe for unhappiness, spend your time accumulating a lot of money and let your health and relationships deteriorate."
  },
  {
    "quote": "Frankly, the most valuable items in our house might be a squat rack, a bench, and a set of weights. I thought I was purchasing gym equipment, but I was actually buying peace of mind."
  },
  {
    "quote": "Pay attention to how readily people talk themselves out of things—and be wary of adopting the same narrative. People will often try to convince you their limiting beliefs should become your own. They do not. Find your own ceiling."
  },
  {
    "quote": "You should always be rooting for the people you know. Not only because you may need their support tomorrow, but also because it feels good to celebrate something.\n\nCelebration can rescue your day—even if it is someone else’s victory. Envy will ruin your day—even if you’re actually winning."
  },
  {
    "quote": "When I go into a situation, I try to keep a mindset of baseline optimism.\n\nWhen starting the day: It’s going to be a good day.\nWhen meeting someone new: I’m going to like them.\nWhen trying something challenging: It’s going to work out.\n\nProblems will inevitably arise and I’ll deal with them as the situation demands, but my preference is to assume I’m on a winning path until proven otherwise."
  },
  {
    "quote": "I think about decisions in three ways: hats, haircuts, and tattoos.\n\nMost decisions are like hats. Try one and if you don’t like it, put it back and try another. The cost of a mistake is low, so move quickly and try a bunch of hats.\n\nSome decisions are like haircuts. You can fix a bad one, but it won’t be quick and you might feel foolish for awhile. That said, don’t be scared of a bad haircut. Trying something new is usually a risk worth taking. If it doesn’t work out, by this time next year you will have moved on and so will everyone else.\n\nA few decisions are like tattoos. Once you make them, you have to live with them. Some mistakes are irreversible. Maybe you’ll move on for a moment, but then you’ll glance in the mirror and be reminded of that choice all over again. Even years later, the decision leaves a mark. When you’re dealing with an irreversible choice, move slowly and think carefully."
  },
  {
    "quote": "The more things you have, the more things you have to manage.\n\nSimplicity isn’t merely cheaper, it’s easier."
  },
  {
    "quote": "Always ask, but never expect.\n\nAlways ask for what you want. Many people are happy to help—if the request is direct and specific. In a surprising number of cases, something remarkable is possible if you have the courage to ask.\n\nNever expect people to say yes. Everyone is busy and balancing multiple priorities. Your request is not their responsibility. When you’re told no, move on lightly and freely. The world is full of opportunity."
  },
  {
    "quote": "Stop paying so much attention to what everyone else is doing and run your own race. How much time is spent reading other people’s posts on social media, watching other people’s exploits in the news, listening to other people’s ideas on podcasts? Go have coffee with a friend. Go make something. Go outside. All those hours spent looking at someone else’s life on a screen could be used to take action in your own life."
  },
  {
    "quote": "Who knows you is more important than who you know. Build a brand."
  },
  {
    "quote": "It is not worth it to be greedy over a single transaction. Even if you’re not going to work with the person again. Even if you think word won’t get out. Even if you think this is your one shot to make it. Reputation follows you everywhere."
  },
  {
    "quote": "If you want a simple formula for having a good day, then get a workout done and do your most important task before lunch. Knock out those two things by noon and you really feel like you’re ahead of the day."
  },
  {
    "quote": "Don’t sacrifice peace of mind for a piece of luxury."
  },
  {
    "quote": "The secret is not to find the meaning of life, but to use your life to make things that are meaningful."
  },
  {
    "quote": "Do things for your own satisfaction. Consider praise from others to be a bonus. If you don’t work for their validation in the first place, you won’t need it to feel satisfied once it’s done."
  },
  {
    "quote": "If you want to avoid criticism, create less.\n\nIf you want to avoid irrelevance, create more."
  },
  {
    "quote": "I can’t control the other person’s behavior, but I can control my response. Their actions may be rude or unacceptable, but I still want my response to be measured and thoughtful. Even if they aren’t doing what is right, I still want to make sure I’m doing what is right."
  },
  {
    "quote": "In theory, consistency is about being disciplined, determined, and unwavering.\n\nIn practice, consistency is about being adaptable. Don’t have much time? Scale it down. Don’t have much energy? Do the easy version. Find different ways to show up depending on the circumstances. Let your habits change shape to meet the demands of the day.\n\nAdaptability is the way of consistency."
  }
]