[
  {
    "quote": "The pessimist criticizes, the optimist creates."
  },
  {
    "quote": "Save more money than you think you need. Life is unexpected and your future tastes will likely be more expensive. Not worrying about money tomorrow is worth more than whatever you could buy today."
  },
  {
    "quote": "I have learned that whenever I think 'I don’t have enough time to do that' what I usually mean is 'I don’t have enough energy' or 'I am not actually interested in doing this. What I need to do a better job of is not managing my time, but rather caring for myself and identifying my true interests. When I am well rested and working on something I am genuinely excited about, finding time is rarely a problem."
  },
  {
    "quote": "The days can be easy if the years are consistent. You can write a book or get in shape or code a piece of software in 30 minutes per day. But the key is you can’t miss a bunch of days."
  },
  {
    "quote": "The wedding is an event, love is a practice.\n\nThe graduation is an event, education is a practice.\n\nThe race is an event, fitness is a practice.\n\nThe heart, mind, and body are endless pursuits."
  },
  {
    "quote": "The obvious way to buy back your time is to pay someone to do something for you. Pay the mechanic to change your oil or a dry cleaner to press your suit.\n\nThe less obvious way to buy back your time is to say no. Passing on a promotion might “buy"
  },
  {
    "quote": "If you want a recipe for unhappiness, spend your time accumulating a lot of money and let your health and relationships deteriorate."
  },
  {
    "quote": "Frankly, the most valuable items in our house might be a squat rack, a bench, and a set of weights. I thought I was purchasing gym equipment, but I was actually buying peace of mind."
  },
  {
    "quote": "Pay attention to how readily people talk themselves out of things—and be wary of adopting the same narrative. People will often try to convince you their limiting beliefs should become your own. They do not. Find your own ceiling."
  },
  {
    "quote": "You should always be rooting for the people you know. Not only because you may need their support tomorrow, but also because it feels good to celebrate something.\n\nCelebration can rescue your day—even if it is someone else’s victory. Envy will ruin your day—even if you’re actually winning."
  },
  {
    "quote": "When I go into a situation, I try to keep a mindset of baseline optimism.\n\nWhen starting the day: It’s going to be a good day.\nWhen meeting someone new: I’m going to like them.\nWhen trying something challenging: It’s going to work out.\n\nProblems will inevitably arise and I’ll deal with them as the situation demands, but my preference is to assume I’m on a winning path until proven otherwise."
  },
  {
    "quote": "I think about decisions in three ways: hats, haircuts, and tattoos.\n\nMost decisions are like hats. Try one and if you don’t like it, put it back and try another. The cost of a mistake is low, so move quickly and try a bunch of hats.\n\nSome decisions are like haircuts. You can fix a bad one, but it won’t be quick and you might feel foolish for awhile. That said, don’t be scared of a bad haircut. Trying something new is usually a risk worth taking. If it doesn’t work out, by this time next year you will have moved on and so will everyone else.\n\nA few decisions are like tattoos. Once you make them, you have to live with them. Some mistakes are irreversible. Maybe you’ll move on for a moment, but then you’ll glance in the mirror and be reminded of that choice all over again. Even years later, the decision leaves a mark. When you’re dealing with an irreversible choice, move slowly and think carefully."
  },
  {
    "quote": "The more things you have, the more things you have to manage.\n\nSimplicity isn’t merely cheaper, it’s easier."
  },
  {
    "quote": "Always ask, but never expect.\n\nAlways ask for what you want. Many people are happy to help—if the request is direct and specific. In a surprising number of cases, something remarkable is possible if you have the courage to ask.\n\nNever expect people to say yes. Everyone is busy and balancing multiple priorities. Your request is not their responsibility. When you’re told no, move on lightly and freely. The world is full of opportunity."
  },
  {
    "quote": "Stop paying so much attention to what everyone else is doing and run your own race. How much time is spent reading other people’s posts on social media, watching other people’s exploits in the news, listening to other people’s ideas on podcasts? Go have coffee with a friend. Go make something. Go outside. All those hours spent looking at someone else’s life on a screen could be used to take action in your own life."
  },
  {
    "quote": "Who knows you is more important than who you know. Build a brand."
  },
  {
    "quote": "It is not worth it to be greedy over a single transaction. Even if you’re not going to work with the person again. Even if you think word won’t get out. Even if you think this is your one shot to make it. Reputation follows you everywhere."
  },
  {
    "quote": "If you want a simple formula for having a good day, then get a workout done and do your most important task before lunch. Knock out those two things by noon and you really feel like you’re ahead of the day."
  },
  {
    "quote": "Don’t sacrifice peace of mind for a piece of luxury."
  },
  {
    "quote": "The secret is not to find the meaning of life, but to use your life to make things that are meaningful."
  },
  {
    "quote": "Do things for your own satisfaction. Consider praise from others to be a bonus. If you don’t work for their validation in the first place, you won’t need it to feel satisfied once it’s done."
  },
  {
    "quote": "If you want to avoid criticism, create less.\n\nIf you want to avoid irrelevance, create more."
  },
  {
    "quote": "I can’t control the other person’s behavior, but I can control my response. Their actions may be rude or unacceptable, but I still want my response to be measured and thoughtful. Even if they aren’t doing what is right, I still want to make sure I’m doing what is right."
  },
  {
    "quote": "In theory, consistency is about being disciplined, determined, and unwavering.\n\nIn practice, consistency is about being adaptable. Don’t have much time? Scale it down. Don’t have much energy? Do the easy version. Find different ways to show up depending on the circumstances. Let your habits change shape to meet the demands of the day.\n\nAdaptability is the way of consistency."
  },
  {
    "quote": "You can go to hell without moving an inch, just focus on what you lack.\n\nYou can taste heaven without leaving earth, just rejoice in what you have."
  },
  {
    "quote": "The simplest way to clarify your thinking is to write a full page about whatever you are dealing with and then delete everything except the 1-2 sentences that explain it best."
  },
  {
    "quote": "The reason people get good ideas in the shower is because it’s the only time during the day when most people are away from screens long enough to think clearly. The lesson is not to take more showers, but rather to make more time to think."
  },
  {
    "quote": "The beginner chases the right answers.\n\nThe master chases the right questions."
  },
  {
    "quote": "Flexibility alone is not a great strategy, but the lack of it can ruin one."
  },
  {
    "quote": "How to clarify a concept you can’t articulate:\n\n1. Change mediums. Draw it. Photograph it. Sing it.\n\n2. Change levels. Explain what is one level up (bigger picture) or one level down (finer details).\n\n3. Change fields. What would this concept look like in different fields?"
  },
  {
    "quote": "A truth unsaid can still be felt.\n\nWhat needs to be discussed, but hasn’t been said yet?\n\nClear the air."
  },
  {
    "quote": "My friend, who sometimes shares his writing with me, once said my feedback always falls into three categories:\n\n1. Make it shorter.\n\n2. Make it more appealing.\n\n3. How could it apply to more people?"
  },
  {
    "quote": "Some people get addicted to chain-smoking their problems. They spend all day going from sorrow to sorrow. It doesn’t have to be that way. You can live each day going from joy to joy—like a sunflower that turns to face the sun as it moves across the sky. It’s not about having a problem-free life, but about focusing on the light. Sunflowers still have shadows, but they are always behind them."
  },
  {
    "quote": "Laughter itself cannot make a great relationship, but the lack of it can spoil one."
  },
  {
    "quote": "Holding onto anger and resentment is like scuba diving with an anchor. As long as you’re clinging to it, you’re bound to the seabed, limited in movement, unable to appreciate the coral reefs and the colorful fish that dart in and out of view.\n\nForgiveness is letting go of the anchor. It isn’t about declaring what was done to you is okay, but about unburdening yourself so you can swim freely. Forgiveness is a gift you give yourself. It’s the gift of letting go of the anchors you’ve been carrying."
  },
  {
    "quote": "I split problems into two groups: muddy puddles and leaky ceilings.\n\nSome problems are like muddy puddles. The way to clear a muddy puddle is to leave it alone. The more you mess with it, the muddier it becomes. Many of the problems I dream up when I’m overthinking or worrying or ruminating fall into this category. Is life really falling apart or am I just in a sour mood? Is this as hard as I’m making it or do I just need to go workout? Drink some water. Go for a walk. Get some sleep. Go do something else and give the puddle time to turn clear.\n\nOther problems are like a leaky ceiling. Ignore a small leak and it will always widen. Relationship tension that goes unaddressed. Overspending that becomes a habit. One missed workout drifting into months of inactivity. Some problems multiply when left unattended. You need to intervene now.\n\nAre you dealing with a leak or a puddle?"
  },
  {
    "quote": "If you feel resistance before you begin, it’s usually procrastination and you need to get started.\n\nIf you feel resistance after you begin, it’s usually feedback and you need to make adjustments."
  },
  {
    "quote": "Focus is how you knit the hours of the day together. With focus, the day becomes a beautiful tapestry. Without focus, you end up holding a bundle of loose string."
  },
  {
    "quote": "Anytime in my life when I have managed to go from a vision to a reality, the vision has not been a plan but a practice.\n\nIn other words, what matters is not having a vision, but rather making a habit of returning to and revising the vision. For the big things in my life, I’m always coming back to them week after week—sometimes day after day. As new information arrives, the vision gets updated. The dream becomes more crystallized over time. It’s a habit of thinking about where you want to go with an ever-increasing degree of clarity.\n\nYou do not need a vision, you need the practice of envisioning."
  },
  {
    "quote": "You don’t need to worry about progressing slowly. You need to worry about climbing the wrong mountain."
  },
  {
    "quote": "If you already live a comfortable life, then choosing to make more money but live a worse daily life is a bad trade.\n\nAnd yet, we talk ourselves into it all the time. We take promotions that pay more, but swallow our free time. We already have a successful business, but we break ourselves trying to make it even more successful.\n\nToo much focus on wealth, not enough focus on lifestyle."
  },
  {
    "quote": "Mastery is not only about getting better at your craft, but also about finding ways to eliminate the obstacles, distractions, and other annoyances that prevent you from working on your craft.\n\nTop performers find ways to spend as much time as possible on what matters and as little time as possible on what doesn’t. It is not someone else’s responsibility to create the conditions for success.\n\nYou have to actively work to eliminate the things that don’t matter from your workload. If you haven’t figured out how to do that, you haven’t mastered your craft."
  },
  {
    "quote": "Wisdom is the echo of experience."
  },
  {
    "quote": "Early feedback is usually better than late criticism. Delaying the conversation or stringing someone along with indirect feedback won’t make them feel better once the real issue is finally addressed. Nobody likes getting bad news, but everyone appreciates clarity."
  },
  {
    "quote": "A simple recipe for finding opportunities:\n\nBe pleasant\nAsk questions\nEngage daily\n\nIt’s hard for a warm and pleasant person who is asking a lot of questions and engaging in their industry daily to not come across interesting opportunities."
  },
  {
    "quote": "Never outsource what you enjoy."
  },
  {
    "quote": "How to connect with others:\n\nShare with someone who wants to listen or listen to someone who wants to share."
  },
  {
    "quote": "People can help you in many ways throughout life, but there are two things nobody can give you: curiosity and drive. They must be self-supplied.\n\nIf you are not interested and curious, all the information in the world can be at your fingertips, but it will be relatively useless. If you are not motivated and driven, whatever connections or opportunities are available to you will be rendered inert.\n\nNow, you won’t feel curious and driven about every area of life, and that’s fine. But it really pays to find something that lights you up. This is one of the primary quests of life: to find the thing that ignites your curiosity and drive.\n\nThere are many recipes for success. There is no single way to win. But nearly all recipes include two ingredients: curiosity and drive."
  },
  {
    "quote": "You can ignore your weaknesses, but you can’t expect them to not impact you. The weakness of the coach shapes the players. The weakness of the teacher influences the students. The weakness of the parent molds the child."
  },
  {
    "quote": "Don’t wait to start writing until you have something to say. Start writing so you can find out what you have to say.\n\nYou first idea is rarely your best idea. It can take a lot of reps before you discover something worth keeping."
  },
  {
    "quote": "You will never find one answer to what makes you happy. There are many answers, and they change based on your current state.\n\nPeople need to relax, but if all you do is sit on the beach, it gets old. People find meaning in work, but if all you do is work, it gets exhausting. People benefit from exercise, but if all you do is exercise, it gets unhealthy.\n\nHappiness will always be fleeting because your needs change over time. The question is: what do you need right now?"
  },
  {
    "quote": "My personal rule is that it’s a good idea to be patient as long as I’m in the mix.\n\nIf I’m taking action, putting in my reps, and trying things out, then I should remain patient and see what opportunities arise. But if I’m not taking action consistently, then I’m not practicing patience. I’m just waiting."
  },
  {
    "quote": "You’ll probably surprise yourself with what you can accomplish—if you’re focused on one thing.\n\nYou’ll probably frustrate yourself with what you fail to accomplish—if you’re doing 5 or 7 or 10 things.\n\nNobody performs well when stretched in a half dozen directions."
  },
  {
    "quote": "Whether you are an adult or child, your first attempts will often seem unimportant or foolish.\n\nThe open mic night at a nearly empty bar.\nThe early blog posts that get ignored.\nThe dance recital on a little stage.\n\nEarly attempts are easy to dismiss because they don’t seem to amount to much. But you have to do the low stakes stuff to prepare for the high stakes stuff. They are the building blocks of confidence, and that’s an enormous thing."
  },
  {
    "quote": "Clarity isn’t about knowing what you want to do with your life, it’s about knowing what you want to do this week.\n\nYou don’t need to have it all figured out. You just need to know your next step."
  },
  {
    "quote": "Your life will not magically exceed your standards. Improve your boundaries and life improves too."
  },
  {
    "quote": "You can cold email nearly anyone, but nearly everyone overlooks how powerful it can be.\n\nSending one email each week that feels like a stretch can change your life. Will you get turned down? Sure, most of the time. But you only need one to pay off for something amazing to happen.\n\nTake your time, write a thoughtful message, and muster the courage to press Send."
  },
  {
    "quote": "It’s never the right time, but right now is usually the best time."
  },
  {
    "quote": "A simple rule that makes life easier:\n\nAlways strive to give value before you ask for value."
  },
  {
    "quote": "Three ways to learn something new:\n\nReflect on what you have already tried.\nAttempt something you have not tried.\nRead about what someone else has tried."
  },
  {
    "quote": "If you’re having trouble sticking to a new habit, try a smaller version until it becomes automatic. Do less than you’re capable of, but do it more consistently than you have before."
  },
  {
    "quote": "It’s remarkable how often the real problem is not what happened, but how it was communicated."
  },
  {
    "quote": "There are at least 4 types of wealth:\n\nFinancial wealth (money)\nSocial wealth (status)\nTime wealth (freedom)\nPhysical wealth (health)\n\nBe wary of jobs that lure you in with 1 and 2, but rob you of 3 and 4."
  },
  {
    "quote": "Move toward the next thing, not away from the last thing.\n\nSame direction. Completely different energy."
  },
  {
    "quote": "Guilt lives in the past.\n\nWorry lives in the future.\n\nPeace lives in the present."
  },
  {
    "quote": "Mastery requires lots of practice. But the more you practice something, the more boring and routine it becomes.\n\nThus, an essential component of mastery is the ability to maintain your enthusiasm. The master continues to find the fundamentals interesting."
  },
  {
    "quote": "You can handle whatever you face."
  },
  {
    "quote": "Do not mistake a confident explanation for an accurate prediction.\n\nAn engineer can predict how much weight a steel bridge will hold and you can be quite sure reality will match their calculation. That’s an accurate prediction.\n\nMeanwhile, strongly held opinions about what will happen in markets or sports or politics have little predictive power. A lot of what you hear can be summarized as: confident, but inaccurate."
  },
  {
    "quote": "One of life’s counterintuitive lessons is that you will often gain energy by spending a little bit of energy.\n\nWhen you feel lethargic and like you want to lay around all day, it is usually the case that getting up and moving will make you feel better than simply sitting around. Getting outside for 10 minutes or doing the first set of a workout or simply stretching on the floor for a moment — anything to get your body moving — will often leave you feeling more energized.\n\nIf you want to get your day going, then get your body going. It’s harder for the mind to be sluggish when the body is moving."
  },
  {
    "quote": "Make a mistake? Release the guilt, remember the lesson."
  },
  {
    "quote": "Surround yourself with people who have the same goals as you. Rise together."
  },
  {
    "quote": "Productivity is most important for things you don’t want to be doing. Most people want to increase productivity so they can spend less time on the task.\n\nBut before you worry about being more productive, think about being more selective. Rather than focusing on increasing productivity, it may be worth asking, “What would I be delighted to spend time on, even if it went slowly?"
  },
  {
    "quote": "Carry an ambitious question with you each day and keep looking for answers."
  },
  {
    "quote": "I’m not the best writer, but it is a strength. I might be a 90th percentile writer.\n\nAnd I’m not the best marketer, but it is a strength. Again, maybe 90th percentile? I’m better than most, but if you pass 100 people on the street it won’t be hard to find some people better than me.\n\nWhat I have gradually learned is that it is not your strengths, but your combination of strengths that sets you apart. It is the fact that writing and marketing are mutually reinforcing—and that I enjoy both—that leads to great results.\n\nHow can you combine your strengths? That’s something I would encourage everyone to think about. You will find talented people in every area of life. It’s the combinations that are rare."
  },
  {
    "quote": "When you choose the benefits of an action, you also choose the drawbacks.\n\nIf you want to be an author, you can’t only choose the finished novel and book signings. You are also choosing months of lonely typing. If you want to be a bodybuilder, you can’t only choose the fit body and attention. You are also choosing the boring meals and calorie counting.\n\nYou have to want the lifestyle, not just the outcomes. Otherwise, it doesn’t make any sense being jealous. The results of success are usually public and highly visible, but the process behind success is often private and hidden from view. It’s easy to want the public rewards, but also you have to want the hidden costs."
  },
  {
    "quote": "The first minute of action is worth more than a year of perfect planning."
  },
  {
    "quote": "One of the great mistakes in life is suffering for years because you didn’t want to feel foolish for five minutes.\n\nYou don’t want to apologize, so you let a relationship deteriorate.\nYou’re scared of the sting of rejection, so you don’t ask for what you want.\nYou fear people will say your idea is dumb, so you never start the business.\n\nNobody likes feeling foolish, but the feeling fades quickly. The willingness to endure five minutes of discomfort turns out to be a meaningful dividing line in life."
  },
  {
    "quote": "In my early 20s, I wrote a list of ambitious things I wanted to do in life. Go bungee jumping. Create a movie. Start a business. That sort of thing. I did a few of them, but not most.\n\nLooking back, however, that list was incredibly valuable because it taught me the usefulness of chasing bold ideas—even if they never materialize. The dreams that didn’t happen changed shape and led me down other interesting paths.\n\nThe important thing isn’t to achieve all your dreams, but to keep dreaming. Your desires change as you learn and grow. Old dreams will spawn new dreams. And eventually, one of these newer, more refined visions will find their moment and become reality."
  },
  {
    "quote": "When one worldview dominates your thinking, you’ll try to explain every problem you face through that worldview. Read widely and realize there are many answers."
  },
  {
    "quote": "A great relationship is not only finding the person you have fun with, but also finding the person you want to be bored with. The beauty of long-term relationships is often hidden in boring, ordinary moments."
  },
  {
    "quote": "Some projects benefit from early action. If you’re writing a book, it’s easy to spend a lot of time brainstorming titles and dreaming up an outline, but it’s better to simply write. The book discovers itself as you go. Yes, you’ll need to go back and organize things, but this is easier to do once you have material. The key is to act first and then organize your thinking.\n\nOther projects benefit from early planning. The best way to build a skyscraper is to plan carefully. If you start placing steel beams on day one, you’re guaranteed to run into problems. It is harder to make changes once you’ve begun. You’ll need to tear it down and start over again. The key is to organize your thinking and then act.\n\nDo you need early action or early planning?"
  },
  {
    "quote": "In many cases, what you hope to learn by reading books or listening to podcasts can only be learned by attempting what you fear. Some knowledge is only revealed through action."
  },
  {
    "quote": "Creativity is the focused combination of unlikely things. Your mind locks onto a certain element and then searches widely for something unexpected that fits with it. What can scuba diving teach you about agriculture? What can trees teach you about public speaking? There is always some connective tissue between disciplines. If you wish to be more creative, look for the connections between two previously unconnected things."
  },
  {
    "quote": "The bad workouts are the most important ones. It’s easy to train when you feel good, but it’s crucial to show up when you don’t feel like it—even if you do less than you hope.\n\nGoing to the gym for 15 minutes might not improve your performance, but it reaffirms your identity. It’s not always about what happens during the workout. It’s about becoming the type of person who doesn’t miss workouts."
  },
  {
    "quote": "If you’d like to get better at saying no, try this:\n\nKeep a list of things you say no to. Whenever you ignore a distraction or turn down an opportunity, add it to the list. As the list grows, you begin to feel a sense of accomplishment for your ability to say no and remain focused on what matters.\n\nTurn each no into an achievement."
  },
  {
    "quote": "Boredom is a filter. Common ideas come before it. Uncommon ideas come after it. Sit with a project long enough to get bored with it, then sit a little more. The most useful insights bubble up after you get bored."
  },
  {
    "quote": "When you’re younger, it’s easy to underestimate how fleeting the days can be. Each choice matters. Each day matters.\n\nWhen you’re older, it’s easy to underestimate how much opportunity you still have. Don’t talk yourself out of it. It’s never too late to start."
  },
  {
    "quote": "Communication is about what is received, not what is intended. If there is a gap between what you are saying and what they are hearing, you have to find a new way to say it."
  },
  {
    "quote": "Finding your way in life is like unlocking the combination of a safe. You have to go forwards and backwards. Life is not a direct march from A to B. The twists and turns are progress, not regression. What feels like a setback in the moment is later revealed to have been part of the path all along. Each move was necessary to get to your end goal."
  },
  {
    "quote": "The problem with smart people is they can come up with a good reason for not doing anything. They are smart enough to find the cracks, to foresee the challenges, and to talk themselves out of the idea. They are experts at justifying their lack of courage or lack of action with an intelligent excuse.\n\nBut there will always be reasons to not do something, and this is particularly true of anything worth doing. We value those moments in which we overcame challenge, not those in which we avoided it. Ultimately, action is a choice. The choice to emphasize the reasons for doing it despite the reasons you have for avoiding it."
  },
  {
    "quote": "To experience time travel, read.\n\nTo achieve immortality, write."
  },
  {
    "quote": "Do bold things with a pleasant and friendly demeanor."
  },
  {
    "quote": "When you drink water from a cup, it becomes part of you. When water falls on you like rain, it evaporates a few minutes later.\n\nSimilarly, thoughts can be consumed or dismissed. Is this thought nourishing? Is this feeling something you should drink? Or is it more like getting caught in the rain?\n\nYou’ll always feel the rain, but you don’t have to drink the rain. You can let the thought pass and in a few moments the sun will return. You don’t have to claim everything you feel."
  },
  {
    "quote": "Plant the seeds of greatness in your mind."
  },
  {
    "quote": "The strategy required to find a great opportunity (lots of saying yes and exploring widely) is different from the strategy required to make the most of a great opportunity (lots of saying no and remaining focused)."
  },
  {
    "quote": "I have had periods in my career when I have been sprinting full speed and accomplished a great deal and I have had seasons when I have been fairly lazy and coasted on my previous effort.\n\nWhat I have learned is that I am the major obstruction to getting results. Whether external conditions are favorable or unfavorable makes less difference than whether I am fully engaged and consistent. Even in competitive fields, the competition is primarily within yourself."
  },
  {
    "quote": "Clarity is freedom. Know what is important to you and it will grant you the freedom to ignore everything else."
  },
  {
    "quote": "When you’re on the field, play as if nothing else matters.\n\nWhen you’re off the field, remember that the game doesn’t matter at all."
  },
  {
    "quote": "Dreams are fun when they are distant. The imagination loves to play with possibilities when there is no risk of failure.\n\nBut when you find yourself on the verge of action, you pause. You can feel the uncertainty of what lies ahead. Thoughts swirl. Maybe this isn’t the right time? Failure is possible now.\n\nIn that moment—in that short pause that arises when you stand face to face with your dream—is the entirety of life. What you do in that pause is the crucible that forges you. It is the dividing line between being the type of person who thinks about it or the type of person who goes for it.\n\nWhen I really think about it, I want that moment to be my legacy. Not that I won or lost. Not that I looked good or looked like a fool. But that when I had something I really wanted to do, I went for it."
  }
]